<?xml version="1.0"?>
<net name="onnx_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="payload_bytes" type="Parameter" version="opset1">
			<data shape="1,512" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="payload_bytes">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="model.embedding.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="257, 64" offset="0" size="32896" />
			<output>
				<port id="0" precision="FP16" names="model.embedding.weight">
					<dim>257</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="model.embedding.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>257</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>257</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="node__to_copy" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="_to_copy">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32896" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="5" name="node_embedding" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>257</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="embedding">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="32904" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="node_permute" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="permute">
					<dim>1</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="model.conv_blocks.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 64, 7" offset="32928" size="114688" />
			<output>
				<port id="0" precision="FP16" names="model.conv_blocks.0.weight">
					<dim>128</dim>
					<dim>64</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="model.conv_blocks.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="node_Conv_31/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="3" pads_end="3" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="model.conv_blocks.0.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128" offset="147616" size="256" />
			<output>
				<port id="0" precision="FP16" names="model.conv_blocks.0.bias">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="model.conv_blocks.0.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="147872" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="ShapeOf_19" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="ShapeOf_11" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="ShapeOf_12" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_14" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="147880" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Subtract_15" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Broadcast_16" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Concat_20" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Reshape_21" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="node_Conv_31" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="getitem">
					<dim>1</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="node_relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu">
					<dim>1</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="node_max_pool1d" type="MaxPool" version="opset8">
			<data strides="2" dilations="1" pads_begin="0" pads_end="0" kernel="2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="max_pool1d">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="model.conv_blocks.4.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 5" offset="147888" size="163840" />
			<output>
				<port id="0" precision="FP16" names="model.conv_blocks.4.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="model.conv_blocks.4.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="node_Conv_32/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="2" pads_end="2" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model.conv_blocks.4.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128" offset="311728" size="256" />
			<output>
				<port id="0" precision="FP16" names="model.conv_blocks.4.bias">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="model.conv_blocks.4.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_30" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="147872" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="ShapeOf_36" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="ShapeOf_28" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="ShapeOf_29" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_31" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="147880" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Subtract_32" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Broadcast_33" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Concat_37" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Reshape_38" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="node_Conv_32" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="getitem_3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="node_relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="node_max_pool1d_1" type="MaxPool" version="opset8">
			<data strides="2" dilations="1" pads_begin="0" pads_end="0" kernel="2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="max_pool1d_1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="model.conv_blocks.8.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 128, 3" offset="311984" size="196608" />
			<output>
				<port id="0" precision="FP16" names="model.conv_blocks.8.weight">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model.conv_blocks.8.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="node_Conv_33/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="1" pads_end="1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="model.conv_blocks.8.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256" offset="508592" size="512" />
			<output>
				<port id="0" precision="FP16" names="model.conv_blocks.8.bias">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="model.conv_blocks.8.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_47" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="147872" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="ShapeOf_53" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="ShapeOf_45" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="ShapeOf_46" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_48" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="147880" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Subtract_49" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Broadcast_50" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Concat_54" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Reshape_55" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="node_Conv_33" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="getitem_6">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="node_relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="node_max_pool1d_2" type="MaxPool" version="opset8">
			<data strides="2" dilations="1" pads_begin="0" pads_end="0" kernel="2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="max_pool1d_2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="model.conv_blocks.12.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 3" offset="509104" size="393216" />
			<output>
				<port id="0" precision="FP16" names="model.conv_blocks.12.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="model.conv_blocks.12.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="node_Conv_34/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="1" pads_end="1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="model.conv_blocks.12.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256" offset="902320" size="512" />
			<output>
				<port id="0" precision="FP16" names="model.conv_blocks.12.bias">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="model.conv_blocks.12.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_64" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="147872" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="ShapeOf_70" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="ShapeOf_62" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="ShapeOf_63" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_65" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="147880" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Subtract_66" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Broadcast_67" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Concat_71" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Reshape_72" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="node_Conv_34" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="getitem_9">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="node_relu_3" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="val_29" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="902832" size="8" />
			<output>
				<port id="0" precision="I64" names="val_29">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="node_unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="unsqueeze">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="val_32" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="902840" size="16" />
			<output>
				<port id="0" precision="I64" names="val_32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="node_mean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="mean">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="node_squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeeze">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="val_33" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="902856" size="8" />
			<output>
				<port id="0" precision="I64" names="val_33">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="node_squeeze_1" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeeze_1">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="model.classifier.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 256" offset="902864" size="65536" />
			<output>
				<port id="0" precision="FP16" names="model.classifier.0.weight">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="model.classifier.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="node_linear/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_84_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="968400" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="86" name="Constant_84" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="87" name="Multiply_87" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_85_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="968400" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="89" name="Constant_85" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="90" name="model.classifier.0.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128" offset="968402" size="256" />
			<output>
				<port id="0" precision="FP16" names="model.classifier.0.bias">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="model.classifier.0.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Multiply_88" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="node_linear" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="node_relu_4" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_4">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="model.classifier.3.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="968658" size="256" />
			<output>
				<port id="0" precision="FP16" names="model.classifier.3.weight">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="model.classifier.3.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="node_linear_1/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_93_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="968400" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="99" name="Constant_93" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="100" name="Multiply_96" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_94_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="968400" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="102" name="Constant_94" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="103" name="model.classifier.3.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="968914" size="2" />
			<output>
				<port id="0" precision="FP16" names="model.classifier.3.bias">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="model.classifier.3.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Multiply_97" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="node_linear_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear_1">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="suspicious_prob" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="suspicious_prob">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="suspicious_prob/sink_port_0" type="Result" version="opset1" output_names="suspicious_prob">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="3" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="5" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="5" to-port="1" />
		<edge from-layer="4" from-port="0" to-layer="5" to-port="2" />
		<edge from-layer="5" from-port="3" to-layer="7" to-port="0" />
		<edge from-layer="6" from-port="0" to-layer="7" to-port="1" />
		<edge from-layer="7" from-port="2" to-layer="10" to-port="0" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="1" />
		<edge from-layer="10" from-port="2" to-layer="15" to-port="0" />
		<edge from-layer="10" from-port="2" to-layer="22" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="21" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="20" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="19" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="20" to-port="1" />
		<edge from-layer="15" from-port="1" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="18" to-port="0" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="1" />
		<edge from-layer="18" from-port="2" to-layer="19" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="20" to-port="2" />
		<edge from-layer="20" from-port="3" to-layer="21" to-port="1" />
		<edge from-layer="21" from-port="2" to-layer="22" to-port="1" />
		<edge from-layer="22" from-port="2" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0" />
		<edge from-layer="24" from-port="1" to-layer="27" to-port="0" />
		<edge from-layer="25" from-port="0" to-layer="26" to-port="0" />
		<edge from-layer="26" from-port="1" to-layer="27" to-port="1" />
		<edge from-layer="27" from-port="2" to-layer="32" to-port="0" />
		<edge from-layer="27" from-port="2" to-layer="39" to-port="0" />
		<edge from-layer="28" from-port="0" to-layer="29" to-port="0" />
		<edge from-layer="29" from-port="1" to-layer="38" to-port="0" />
		<edge from-layer="29" from-port="1" to-layer="31" to-port="0" />
		<edge from-layer="30" from-port="0" to-layer="36" to-port="0" />
		<edge from-layer="30" from-port="0" to-layer="37" to-port="0" />
		<edge from-layer="31" from-port="1" to-layer="37" to-port="1" />
		<edge from-layer="32" from-port="1" to-layer="33" to-port="0" />
		<edge from-layer="33" from-port="1" to-layer="35" to-port="0" />
		<edge from-layer="34" from-port="0" to-layer="35" to-port="1" />
		<edge from-layer="35" from-port="2" to-layer="36" to-port="1" />
		<edge from-layer="36" from-port="2" to-layer="37" to-port="2" />
		<edge from-layer="37" from-port="3" to-layer="38" to-port="1" />
		<edge from-layer="38" from-port="2" to-layer="39" to-port="1" />
		<edge from-layer="39" from-port="2" to-layer="40" to-port="0" />
		<edge from-layer="40" from-port="1" to-layer="41" to-port="0" />
		<edge from-layer="41" from-port="1" to-layer="44" to-port="0" />
		<edge from-layer="42" from-port="0" to-layer="43" to-port="0" />
		<edge from-layer="43" from-port="1" to-layer="44" to-port="1" />
		<edge from-layer="44" from-port="2" to-layer="49" to-port="0" />
		<edge from-layer="44" from-port="2" to-layer="56" to-port="0" />
		<edge from-layer="45" from-port="0" to-layer="46" to-port="0" />
		<edge from-layer="46" from-port="1" to-layer="48" to-port="0" />
		<edge from-layer="46" from-port="1" to-layer="55" to-port="0" />
		<edge from-layer="47" from-port="0" to-layer="53" to-port="0" />
		<edge from-layer="47" from-port="0" to-layer="54" to-port="0" />
		<edge from-layer="48" from-port="1" to-layer="54" to-port="1" />
		<edge from-layer="49" from-port="1" to-layer="50" to-port="0" />
		<edge from-layer="50" from-port="1" to-layer="52" to-port="0" />
		<edge from-layer="51" from-port="0" to-layer="52" to-port="1" />
		<edge from-layer="52" from-port="2" to-layer="53" to-port="1" />
		<edge from-layer="53" from-port="2" to-layer="54" to-port="2" />
		<edge from-layer="54" from-port="3" to-layer="55" to-port="1" />
		<edge from-layer="55" from-port="2" to-layer="56" to-port="1" />
		<edge from-layer="56" from-port="2" to-layer="57" to-port="0" />
		<edge from-layer="57" from-port="1" to-layer="58" to-port="0" />
		<edge from-layer="58" from-port="1" to-layer="61" to-port="0" />
		<edge from-layer="59" from-port="0" to-layer="60" to-port="0" />
		<edge from-layer="60" from-port="1" to-layer="61" to-port="1" />
		<edge from-layer="61" from-port="2" to-layer="66" to-port="0" />
		<edge from-layer="61" from-port="2" to-layer="73" to-port="0" />
		<edge from-layer="62" from-port="0" to-layer="63" to-port="0" />
		<edge from-layer="63" from-port="1" to-layer="65" to-port="0" />
		<edge from-layer="63" from-port="1" to-layer="72" to-port="0" />
		<edge from-layer="64" from-port="0" to-layer="70" to-port="0" />
		<edge from-layer="64" from-port="0" to-layer="71" to-port="0" />
		<edge from-layer="65" from-port="1" to-layer="71" to-port="1" />
		<edge from-layer="66" from-port="1" to-layer="67" to-port="0" />
		<edge from-layer="67" from-port="1" to-layer="69" to-port="0" />
		<edge from-layer="68" from-port="0" to-layer="69" to-port="1" />
		<edge from-layer="69" from-port="2" to-layer="70" to-port="1" />
		<edge from-layer="70" from-port="2" to-layer="71" to-port="2" />
		<edge from-layer="71" from-port="3" to-layer="72" to-port="1" />
		<edge from-layer="72" from-port="2" to-layer="73" to-port="1" />
		<edge from-layer="73" from-port="2" to-layer="74" to-port="0" />
		<edge from-layer="74" from-port="1" to-layer="76" to-port="0" />
		<edge from-layer="75" from-port="0" to-layer="76" to-port="1" />
		<edge from-layer="75" from-port="0" to-layer="79" to-port="1" />
		<edge from-layer="76" from-port="2" to-layer="78" to-port="0" />
		<edge from-layer="77" from-port="0" to-layer="78" to-port="1" />
		<edge from-layer="78" from-port="2" to-layer="79" to-port="0" />
		<edge from-layer="79" from-port="2" to-layer="81" to-port="0" />
		<edge from-layer="80" from-port="0" to-layer="81" to-port="1" />
		<edge from-layer="81" from-port="2" to-layer="84" to-port="0" />
		<edge from-layer="82" from-port="0" to-layer="83" to-port="0" />
		<edge from-layer="83" from-port="1" to-layer="84" to-port="1" />
		<edge from-layer="84" from-port="2" to-layer="87" to-port="0" />
		<edge from-layer="85" from-port="0" to-layer="86" to-port="0" />
		<edge from-layer="86" from-port="1" to-layer="87" to-port="1" />
		<edge from-layer="87" from-port="2" to-layer="93" to-port="0" />
		<edge from-layer="88" from-port="0" to-layer="89" to-port="0" />
		<edge from-layer="89" from-port="1" to-layer="92" to-port="0" />
		<edge from-layer="90" from-port="0" to-layer="91" to-port="0" />
		<edge from-layer="91" from-port="1" to-layer="92" to-port="1" />
		<edge from-layer="92" from-port="2" to-layer="93" to-port="1" />
		<edge from-layer="93" from-port="2" to-layer="94" to-port="0" />
		<edge from-layer="94" from-port="1" to-layer="97" to-port="0" />
		<edge from-layer="95" from-port="0" to-layer="96" to-port="0" />
		<edge from-layer="96" from-port="1" to-layer="97" to-port="1" />
		<edge from-layer="97" from-port="2" to-layer="100" to-port="0" />
		<edge from-layer="98" from-port="0" to-layer="99" to-port="0" />
		<edge from-layer="99" from-port="1" to-layer="100" to-port="1" />
		<edge from-layer="100" from-port="2" to-layer="106" to-port="0" />
		<edge from-layer="101" from-port="0" to-layer="102" to-port="0" />
		<edge from-layer="102" from-port="1" to-layer="105" to-port="0" />
		<edge from-layer="103" from-port="0" to-layer="104" to-port="0" />
		<edge from-layer="104" from-port="1" to-layer="105" to-port="1" />
		<edge from-layer="105" from-port="2" to-layer="106" to-port="1" />
		<edge from-layer="106" from-port="2" to-layer="107" to-port="0" />
		<edge from-layer="107" from-port="1" to-layer="108" to-port="0" />
	</edges>
	<rt_info />
</net>
